In [1]:
%matplotlib inline
import pandas as pd
import numpy as np

In [2]:
url="cast.csv"
cast = pd.read_csv(url)
cast.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

In [3]:
cast.shape

(3311647, 6)

In [4]:
cast.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3311647 entries, 0 to 3311646
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   title      object
 1   year       int64
 2   name       object
 3   type       object
 4   character  object
 5   n          float64
dtypes: float64(1), int64(1), object(4)
memory usage: 151.6+ MB

In [5]:
cast.title.value_counts().sum()

3311647

In [6]:
cast.sort_values("year").head(2)

,title,year,name,type,character,n
511376,Miss Jerry,1894,Chauncey Depew,actor,Himself - the Director of the New York Central...,NaN
427108,Miss Jerry,1894,William Courtenay,actor,Mr. Hamilton,NaN

In [7]:
cast[cast["title"]=="Hamlet"].value_counts().sum()

234

In [8]:
cast[cast["title"]=="North by Northwest"].value_counts().sum()

16

In [4]:
cast[cast["title"]=="Hamlet"].sort_values("year")

          title  year                name     type character    n
1422895  Hamlet  1910   Jean Mounet-Sully    actor    Hamlet  NaN
3091449  Hamlet  1911       Emilie Sannom  actress   Ophelia  4.0
879545   Hamlet  1911         Aage Hertel    actor  Claudius  2.0
2227654  Hamlet  1911    Einar Zangenberg    actor   Laertes  5.0
1134887  Hamlet  1911     Oscar Langkilde    actor   Horatio  6.0
...         ...   ...                 ...      ...       ...  ...
2988862  Hamlet  2015        Maxine Peake  actress    Hamlet  1.0
72529    Hamlet  2015  Thomas (II) Arnold    actor   Horatio  5.0
2328072  Hamlet  2015       Gillian Bevan  actress   Polonia  4.0
2856069  Hamlet  2015      Barbara Marten  actress  Gertrude  3.0
1856419  Hamlet  2015       John Shrapnel    actor  Claudius  2.0

[299 rows x 6 columns]

In [10]:
cast[cast["title"]=="Treasure Island"].sort_values("year")

,title,year,name,type,character,n
1304778,Treasure Island,1918,Herschel Mayall,actor,Prologue Player,NaN
3258893,Treasure Island,1918,Eleanor Washington,actress,Prologue Player,NaN
3026895,Treasure Island,1918,Violet Radcliffe,actress,Long John Silver,3.0
1160631,Treasure Island,1918,Raymond Lee,actor,Bit Role,NaN
1188122,Treasure Island,1918,Elmo Lincoln,actor,Prologue Player,NaN
...,...,...,...,...,...,...
1653669,Treasure Island,1999,Victor Raider-Wexler,actor,Samowitz,10.0
1720561,Treasure Island,1999,Scot Thomas Robinson,actor,Jimmy,11.0
1802485,Treasure Island,1999,Richard Schave,actor,Man,21.0
2693149,Treasure Island,1999,Stephanie Ittleson,actress,Stella,7.0
810348,Treasure Island,1999,Rio Hackford,actor,Hans,23.0

In [11]:
cast[cast["year"]==1950].value_counts().sum()

10377

In [12]:
cast.isna().sum()

title              0
year               0
name               0
type               0
character          0
n            1242072
dtype: int64

In [13]:
cast[cast["year"]==1960].value_counts().sum()

11179

In [20]:
cast[(cast["year"]>=1950) & (cast["year"]<=1959) ].value_counts().sum()

111516

In [ ]:
cast[cast.year.isin([])].sum()

In [22]:
cast[cast["title"]=="Batman"].sort_values("year").head(1)

        title  year          name   type    character   n
86823  Batman  1943  Frank Austin  actor  Hotel Clerk NaN

In [28]:
cast[cast["title"]=="Inception"].type.value_counts()

actor      53
actress    19
Name: type, dtype: int64

In [46]:
cast[(cast["title"]=="Inception") & (cast.n.isna())].type.value_counts()

actor      19
actress     2
Name: type, dtype: int64

In [66]:
cast[(cast["title"]=="Inception") & (cast["n"]!=cast.n.isna())]

,title,year,name,type,character,n
85565,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
130207,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
161273,Inception,2010,Tom Berenger,actor,Browning,8.0
173593,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
228660,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
2972865,Inception,2010,Ellen Page,actress,Ariadne,3.0
3021835,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3045839,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3051953,Inception,2010,Talulah Riley,actress,Blonde,25.0
3265183,Inception,2010,Shannon Welles,actress,Old Mal,51.0

In [62]:
cast[cast["title"]=="North by Northwest"].sort_values("n")

,title,year,name,type,character,n
773496,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3084579,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1292652,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
2776446,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
315343,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
...,...,...,...,...,...,...
3018885,North by Northwest,1959,Maudie Prickett,actress,Elsie - Maid,NaN
3134194,North by Northwest,1959,Doris Singh,actress,First United Nations Receptionist,NaN
3153156,North by Northwest,1959,Helen Spring,actress,Bidder,NaN
3271974,North by Northwest,1959,Susan Whitney,actress,Attendant,NaN
3282483,North by Northwest,1959,Paula Winslowe,actress,Woman at Auction,NaN

In [69]:
cast[(cast["title"]=="Sleuth") & (cast["year"]==1972)].sort_values("n")

,title,year,name,type,character,n
1513570,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
288502,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
330750,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1299944,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2406762,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1285278,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

In [75]:
cast[(cast["title"]=="Hamlet") & (cast["year"]==1921)].character.value_counts().sum()

9

In [84]:
cast[(cast["title"]=="Hamlet") & (cast["year"]==1996)].character.value_counts().sum()

55

In [103]:
cast[cast["character"]=="Hamlet"].character.value_counts()

Hamlet    81
Name: character, dtype: int64

In [109]:
cast[cast["character"]=="Ophelia"].character.value_counts().sum()

96

In [112]:
cast[cast["character"]=="The Dude"].character.value_counts().sum()

16

In [113]:
cast[cast["character"]=="The Stranger"].character.value_counts().sum()

192

In [130]:
cast[cast["name"]=="Sidney Poitier"].name.value_counts().sum()

43

In [133]:
cast[cast["name"]=="Judi Dench"].name.value_counts().sum()

51

In [139]:
cast[(cast["type"]=="actress") & (cast["year"]==1950)].type.value_counts()

actress    5349
Name: type, dtype: int64

In [142]:
cast[(cast["n"]==1) & (cast["year"]<=1980)].n.value_counts()

1.0    61444
Name: n, dtype: int64

In [148]:
cast[cast["title"]=="Potter"]

          title  year                  name     type             character   n
454870   Potter  2015  Peter (II) D'Alfonso    actor          Harry Potter NaN
1733766  Potter  2015       Joe (III) Romeo    actor           Ron Weasley NaN
1991531  Potter  2015     Timothy Tedmanson    actor      Albus Dumbledore NaN
2050909  Potter  2015    Lachlan Tyler-Dowd    actor   Bellatrix Lestrange NaN
2390973  Potter  2015       Erin Carmichael  actress  Professor McGonagall NaN
2426830  Potter  2015    Eloise Cobby-Smith  actress        Lavender Brown NaN
2502284  Potter  2015          Jemma Dougan  actress         Severus Snape NaN
2850659  Potter  2015      Elena Marie-Aloi  actress         Ginny Weasley NaN
2907793  Potter  2015      Lorette Monoghan  actress         Molly Weasley NaN
2924444  Potter  2015         Jasmin Muller  actress          Draco Malfoy NaN
2924489  Potter  2015            Zoe Muller  actress        Moaning Myrtle NaN
2967873  Potter  2015    Alice (IV) Osborne  actress          Fred Weasley NaN
3048836  Potter  2015    Zara (II) Richards  actress     Lily Evans-Potter NaN
3154030  Potter  2015      Rebecca St Clair  actress          James Potter NaN
3157999  Potter  2015   Carli Stasinopoulos  actress        Lord Voldemort NaN
3172529  Potter  2015    Mandy (II) Suggett  actress         Luna Lovegood NaN
3174439  Potter  2015        Maddie Summers  actress      Hermione Granger NaN
3176610  Potter  2015  Natsumi (III) Suzuki  actress             Cho Chang NaN

In [152]:
cast[(cast["n"]==2) & (cast["year"]==1940) & (cast["name"]=="Cary Grant")].sort_values(by="year")

                   title  year        name   type character    n
773493  My Favorite Wife  1940  Cary Grant  actor      Nick  2.0

In [153]:
cast[(cast["year"]==1940) & (cast["name"]=="Cary Grant")].sort_values(by="year")

,title,year,name,type,character,n
773475,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
773493,My Favorite Wife,1940,Cary Grant,actor,Nick,2.0
773518,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
773520,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

In [161]:
cast[(cast["n"]==1) & (cast["year"]==1950) & (cast.type.isin(["actor","actress"]))].type.value_counts()

actor      604
actress    270
Name: type, dtype: int64

In [162]:
cast[(cast["n"]==2) & (cast["year"]==1950) & (cast.type.isin(["actor","actress"]))].type.value_counts()

actor      418
actress    401
Name: type, dtype: int64

In [19]:
cast[(cast["n"]==1) & (cast["year"]==1950) & (cast.type.isin(["actor","actress"]))].type.value_counts().sum()

874

In [168]:
cast[cast["character"]=="Herself"]

,title,year,name,type,character,n
19083,Noel Gallagher's High Flying Birds Live,2012,Eugenie Aichison,actor,Herself,22.0
103666,Alexander Jamieson,2015,Etta Baker,actor,Herself,NaN
175206,Le fils de Gascogne,1995,Ren? Biaggi,actor,Herself,22.0
182995,30 Years Os Dark Seduction,2015,Steve (II) Bishart,actor,Herself,NaN
186661,Forty Shades of Blue,2005,J. Blackfoot,actor,Herself,7.0
...,...,...,...,...,...,...
3309175,Nema-ye Nazdik,1990,Nayer Mohseni Zonoozi,actress,Herself,7.0
3309673,Fictionality,2012,Gabi Zucker,actress,Herself,NaN
3309992,Beziehungsweisen,2012,Heidemarie Zunken-Kreplien,actress,Herself,7.0
3310711,Bendito Canalla,2008,Serafina ?lvarez,actress,Herself,NaN
3310807,Angel,2008,Lisbeth ?kerman,actress,Herself,NaN

In [12]:
cast.n.isna().value_counts()

False    2069575
True     1242072
Name: n, dtype: int64

In [13]:
cast[(cast["title"]=="Inception") & (cast.n.isna())].value_counts()

Series([], dtype: int64)

In [15]:
cast[cast["title"]=="North by Northwest"].value_counts()

title               year  name                  type     character                    n
North by Northwest  1959  Adam Williams         actor    Valerian                     9.0     1
                          Cary Grant            actor    Roger O. Thornhill           1.0     1
                          Edward Binns          actor    Captain Junket               15.0    1
                          Edward Platt          actor    Victor Larrabee              10.0    1
                          Eva Marie Saint       actress  Eve Kendall                  2.0     1
                          James Mason           actor    Phillip Vandamm              3.0     1
                          Jessie Royce Landis   actress  Clara Thornhill              4.0     1
                          Josephine Hutchinson  actress  Mrs. Townsend                6.0     1
                          Ken Lynch             actor    Charley - Chicago Policeman  16.0    1
                          Leo G. Carroll        actor    The Professor                5.0     1
                          Les Tremayne          actor    Auctioneer                   12.0    1
                          Martin Landau         actor    Leonard                      8.0     1
                          Patrick McVey         actor    Sergeant Flamm               14.0    1
                          Philip Coolidge       actor    Dr. Cross                    13.0    1
                          Philip Ober           actor    Lester Townsend              7.0     1
                          Robert Ellenstein     actor    Licht                        11.0    1
dtype: int64

In [16]:
cast[cast["title"]=="North by Northwest"].title.value_counts()

North by Northwest    111
Name: title, dtype: int64

In [18]:
cast[(cast["n"]==1) & (cast["year"]==1950) & (cast.type.isin(["actor","actress"]))].value_counts()

title                      year  name                       type     character                  n
0 Uhr 15, Zimmer 9         1950  Cornell Borchers           actress  Maria Mertens              1.0    1
Samsaram                   1950  Taraka Rama Rao Nandamuri  actor    Raghu                      1.0    1
Rocky Mountain             1950  Errol Flynn                actor    Capt. Lafe Barstow (CSA)   1.0    1
Rogues of Sherwood Forest  1950  John Derek                 actor    Robin, Earl of Huntington  1.0    1
Romanzo d'amore            1950  Danielle Darrieux          actress  Luisa d'Asburgo-Lorena     1.0    1
                                                                                                      ..
High Lonesome              1950  John Drew Barrymore        actor    Cooncat                    1.0    1
Highly Dangerous           1950  Margaret Lockwood          actress  Frances Gray               1.0    1
Highway 301                1950  Steve Cochran              actor    George Legenza             1.0    1
Hills of Oklahoma          1950  Rex Allen                  actor    Rex Allen                  1.0    1
Zwei in einem Anzug        1950  Joe St?ckel                actor    Thomas Bimslechner         1.0    1
Length: 874, dtype: int64

In [3]:
cast[cast["title"]=="North by Northwest"].value_counts()

title               year  name                  type     character                    n
North by Northwest  1959  Adam Williams         actor    Valerian                     9.0     1
                          Cary Grant            actor    Roger O. Thornhill           1.0     1
                          Edward Binns          actor    Captain Junket               15.0    1
                          Edward Platt          actor    Victor Larrabee              10.0    1
                          Eva Marie Saint       actress  Eve Kendall                  2.0     1
                          James Mason           actor    Phillip Vandamm              3.0     1
                          Jessie Royce Landis   actress  Clara Thornhill              4.0     1
                          Josephine Hutchinson  actress  Mrs. Townsend                6.0     1
                          Ken Lynch             actor    Charley - Chicago Policeman  16.0    1
                          Leo G. Carroll        actor    The Professor                5.0     1
                          Les Tremayne          actor    Auctioneer                   12.0    1
                          Martin Landau         actor    Leonard                      8.0     1
                          Patrick McVey         actor    Sergeant Flamm               14.0    1
                          Philip Coolidge       actor    Dr. Cross                    13.0    1
                          Philip Ober           actor    Lester Townsend              7.0     1
                          Robert Ellenstein     actor    Licht                        11.0    1
dtype: int64

In [4]:
cast['decade'] = ((cast.year // 10) * 10)

In [16]:
b=100/4
b

25.0

In [14]:
a=100//4
a

25

In [12]:
type(a)

int

In [17]:
type(b)

float

In [26]:
cast.decade.value_counts().sort_index()

1890         9
1900        70
1910     41799
1920     69817
1930    195865
1940    206348
1950    201920
1960    173216
1970    198845
1980    269250
1990    368219
2000    731742
2010    854508
2020        39
Name: decade, dtype: int64